app/Http/Controllers/Api/ApartmentController.php

        }

        $query->with('apartment_info', 'services', 'images');
        $apartments = $query->get();
---
select * from `apartment_infos` where `apartment_infos`.`apartment_id` in (10)
select `services`.*, `apartment_service`.`apartment_id` as `pivot_apartment_id`, `apartment_service`.`service_id` as `pivot_service_id` from `services` inner join `apartment_service` on `services`.`id` = `apartment_service`.`service_id` where `apartment_service`.`apartment_id` in (10)