app/Http/Controllers/Api/ApartmentController.php

select * from `services`
select * from `apartment_infos` where `apartment_infos`.`apartment_id` in (1, 3, 4, 6, 7, 9, 10, 12, 13)
select * from `apartments` where `visibility` = 1 limit 20 offset 0
select * from `images` where `images`.`apartment_id` in (1, 3, 4, 6, 7, 9, 10, 12, 13)
select * from `users` where `users`.`id` in (1)
---
    public function index(Request $request)
    {
        $apartmentsQuery = Apartment::with(['services', 'apartment_info', 'user', 'images'])->where('visibility', "=", 1);
        $services = Service::all();

        if ($request->has('services')) {
            /*  $servicesSelected = $request->get('services');
               $apartmentsQuery = $apartmentsQuery->join('apartment_service', 'services.id', '=','apartment_service.apartment_id')->join('apartments','apartment_service.id', '=','apartments.id')->select('apartmens.*');
               foreach($servicesSelected as $service){
                  $apartmentsQuery = $apartmentsQuery->where($service, '=', 'service.id');
               } */
        }
        $apartments = $apartmentsQuery->paginate(20);

select * from `apartment_infos` where `apartment_infos`.`apartment_id` in (13)
select * from `apartments` where `visibility` = 1 and exists (select * from `apartment_infos` where `apartments`.`id` = `apartment_infos`.`apartment_id` and `num_beds` = '1')
select `services`.*, `apartment_service`.`apartment_id` as `pivot_apartment_id`, `apartment_service`.`service_id` as `pivot_service_id` from `services` inner join `apartment_service` on `services`.`id` = `apartment_service`.`service_id` where `apartment_service`.`apartment_id` in (13)
---
    public function getFilteredApartments(Request $request)
    {
        $userLatitude = $request->input('latitude');
        $userLongitude = $request->input('longitude');
        $radius = 20;

        $query = Apartment::where('visibility', 1);

        // Filtri per i servizi
        if ($request->has('services')) {
            $servicesSelected = $request->get('services');
            $query->whereHas('services', function ($q) use ($servicesSelected) {
                $q->whereIn('name', $servicesSelected);
            });
        }

        // Filtri avanzati
        if ($request->has('num_beds')) {
            $query->whereHas('apartment_info', function ($q) use ($request) {
                $q->where('num_beds', $request->num_beds);
            });
        }

        if ($request->has('num_rooms')) {
            $query->whereHas('apartment_info', function ($q) use ($request) {
                $q->where('num_rooms', $request->num_rooms);
            });
        }

        if ($request->has('num_bathrooms')) {
            $query->whereHas('apartment_info', function ($q) use ($request) {
                $q->where('num_bathrooms', $request->num_bathrooms);
            });
        }

        if ($request->has('mt_square')) {
            $query->whereHas('apartment_info', function ($q) use ($request) {
                $q->where('mt_square', $request->mt_square);
            });

select * from `apartment_infos` where `apartment_infos`.`apartment_id` in (3, 6, 7)
select `services`.*, `apartment_service`.`apartment_id` as `pivot_apartment_id`, `apartment_service`.`service_id` as `pivot_service_id` from `services` inner join `apartment_service` on `services`.`id` = `apartment_service`.`service_id` where `apartment_service`.`apartment_id` in (3, 6, 7)
---
        }

        $query->with('apartment_info', 'services');
        $apartments = $query->get();