app/Http/Controllers/Admin/ApartmentController.php

    public function edit(Apartment $apartment)
    {
        $services = Service::all();
---
select * from `services`